In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame()

In [5]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [16]:
df1 = pd.DataFrame([[1,2,3,4],[11,12,13,14],[21,22,23,24],[31,32,33,34],[41,52,43,64],[91,92,93,74]])
df1

    0   1   2   3
0   1   2   3   4
1  11  12  13  14
2  21  22  23  24
3  31  32  33  34
4  41  52  43  64
5  91  92  93  74

In [17]:
df1.head(3)

    0   1   2   3
0   1   2   3   4
1  11  12  13  14
2  21  22  23  24

In [14]:
df1.tail(3)

    0   1   2   3
3  31  32  33  34
4  41  52  43  64
5  91  92  93  74

In [19]:
df1.shape

(6, 4)

In [21]:
df1

    0   1   2   3
0   1   2   3   4
1  11  12  13  14
2  21  22  23  24
3  31  32  33  34
4  41  52  43  64
5  91  92  93  74

In [23]:
df1.iloc[0,2]

3

In [25]:
df1.iloc[0:2,2:4] # it means 0:2 first 2 row and 2:4 means col 2 to col 3.

    2   3
0   3   4
1  13  14

In [26]:
df1.iloc[0:2,0:2]

    0   1
0   1   2
1  11  12

In [35]:
df1 = pd.DataFrame([[1,2,3,4],[11,12,13,14],[21,22,23,24],[31,32,33,34],[41,52,43,64],[91,92,93,74]],columns=['A','B','C','D'])
df1

    A   B   C   D
0   1   2   3   4
1  11  12  13  14
2  21  22  23  24
3  31  32  33  34
4  41  52  43  64
5  91  92  93  74